[
    {
      "role": "Web Developer(Full stack Developer)",
      "organisation": "Osler, Hoskin & Harcourt",
      "startDate": "April, 2022",
      "endDate": "Present",
      "experiences": ["Build maintainable, and user-friendly web applications, using React/Angular, Node.js, ASP.NET, C#/ .NET, JavaScript/TypeScript, MSSQL.",
                      "Rearchitect the existing application, porting from Node.js to .NET Technologies, within stringent timeline of 2 weeks.",
                      "Collaborated with a cross functional team to build a robust data validation and management application, improving the efficiency by 60%.",
                      "Improved the performance of the client-faced web application by 80%, by identifying and reducing the performance bottlenecks using VS profiling tools, Monitoring Logs, Chrome Dev Tools.",
                      "Build a web application to send customized daily/weekly notifications to different type of clients leveraging SMTP protocol.",
                      "Fixed CORS issue by developing RESTful API, the broken functionality greatly impacted the business operations.",
                      "Took sole responsibility to migrate On-Premises applications from TFS to Microsoft Azure, cloud based environment"],
      "imageSrc": "history/osler.png"
    },
    {
      "role": "Engineering Assistant",
      "organisation": "Leland Industries",
      "startDate": "April, 2021",
      "endDate": "Oct, 2021",
      "experiences": ["Model relationship between the material properties and failures, intended to reduce product failures by 10%."],
      "imageSrc": "history/leland.png"
    },
    {
      "role": "Engineer",
      "organisation": "Bharat Earth Movers Limited",
      "startDate": "Sept, 2017",
      "endDate": "Dec, 2018",
      "experiences": [
        "Perform tests, prepare Standard Operating Procedures (SOP), technical documents."],
      "imageSrc": "history/beml.png"
    },
    {
      "role": "Junior Engineer",
      "organisation": "Jindal Steel Works",
      "startDate": "Aug, 2014",
      "endDate": "June, 2016",
      "experiences": [
        "Optimizing the manufacturing processes, and required process improvements."],
      "imageSrc": "history/jsw.png"
    }
  ]